Documents/ОптовыйЗаказПоставщикуНаАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ОптовыйЗаказПоставщикуНаАвтомобили</Name>
			<BasedOn>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.ОптовыйЗаказКлиентаНаАвтомобили</xr:Item>
				<xr:Item>Document.ОптовыйЗаказПоставщикуНаАвтомобили</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
				<xr:Item>AccumulationRegister.ЗаказыПоставщикамНаАвтомобили</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ОптовыйЗаказКлиентаНаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.ОптовыйЗаказПоставщикуНаАвтомобили</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор, по которому ведутся взаиморасчеты с поставщиком</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен покупки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнийНомерЗаказа</Name>
					<Comment>Внешний номер заказа</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияОптовогоЗаказаПоставщикуНаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Спецификации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Марка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Марки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Модели</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантКомплектации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цвет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАвтомобиля</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидАвтомобиля</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КлючСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Автомобили</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Автомобиль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Comment>Сумма всегда без скидки. НДС входит в сумму если это указано в типе цен. Сумма всегда равна Цена*Количество</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСкидки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВсего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВозраженияИПричиныОтказов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокСнятияРезерва</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
					<Comment>Набор реквизитов, состав которого определяется компанией</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ЗаказыПоставщикамНаАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаказыПоставщикамНаАвтомобили</Name>
			<Comment>Заказы поставщикам на автомобили</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количество автомобилей по заказу</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма заказанной номенклатуры в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма заказанной номенклатуры в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПоставщику</Name>
					<Comment>Заказ поставщику на автомобиль</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщикуНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.ОптовыйЗаказПоставщикуНаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиАвтомобилей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиАвтомобилей</Name>
			<Comment>Блок учета остатков автомобилей</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Comment>Количественный остаток автомобиля на складе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма в валюте регламентированного учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДС</Name>
					<Comment>Сумма НДС в валюте регламентированного учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДС</Name>
					<Comment>Сумма в валюте регламентированного учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте управленческого учета с налогами</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНДСУпр</Name>
					<Comment>Сумма НДС в валюте управленческого учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезНДСУпр</Name>
					<Comment>Сумма в валюте управленческого учета без налогов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Хозяйственная операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>Ставка НДС</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Comment>Документ продажи</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщикуАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераЗаАвтомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СкладКомпании</Name>
					<Comment>Склад компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатусПартии</Name>
					<Comment>Статус партии, определяющий, чей автомобиль (купленный компанией или принятый на комиссию)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПартий</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Comment>Партия по которой поступил или был взят на комиссию автомобиль</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыПартий</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СостоянияОптовогоЗаказаПоставщикуНаАвтомобили.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияОптовогоЗаказаПоставщикуНаАвтомобили</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ОптовыйЗаказПоставщикуНаАвтомобили/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	// Вызываем общий обработчик события
	ПрефиксацияОбъектов.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры // ПриУстановкеНовогоНомера()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения = "", СтандартнаяОбработка = Истина)
	
	Если ОбработкаСобытийДокументаСервер.ВводСПустымОснованием(ДанныеЗаполнения) Тогда
		//@skip-check module-unused-local-variable
		ВалютаДокумента = РаботаСКурсамиВалютПлатформа.ВалютаТипаЦены(ТипЦен,, Ложь);
	КонецЕсли;
	
	ПродолжатьВыполнение = Не ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка
	);
	
	Если ПродолжатьВыполнение Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Состояние = Перечисления.СостоянияОптовогоЗаказаПоставщикуНаАвтомобили.Черновик;
	
КонецПроцедуры // ОбработкаЗаполнения()

Процедура ПриКопировании(ОбъектКопирования)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

//@skip-check data-exchange-load
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// УтверждениеДокумментов
	УтверждениеДокументовСервер.ОбработкаУтвержденияПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи);
	// Конец УтверждениеДокументов
	
	// Вызываем общий обработчик события
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	Если Не ТипЦен.Пустая() И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипЦен, "Рассчитывается") Тогда
		
		ОбщегоНазначения.СообщитьПользователю(
			НСтр("ru = 'Использование расчетных типов цен запрещено.'"),
			ЭтотОбъект,
			,
			,
			Отказ
		);
		
	КонецЕсли;
	
	Если Состояние <> Перечисления.СостоянияОптовогоЗаказаПоставщикуНаАвтомобили.Черновик Тогда
		
		ЗаказыСервер.СопоставитьСпецификацииИАвтомобили(ЭтотОбъект, Отказ);
		
	КонецЕсли;
	
	РаботаСГраницами.МоментВремениПередПроведением(Ссылка, ДополнительныеСвойства);
	РаботаСГраницами.ДвиженияПоЗаказамАвтомобилейПередПроведением(Ссылка, ДополнительныеСвойства);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// УтверждениеДокумментов
	УтверждениеДокументовСервер.ОбработкаУтвержденияПриЗаписи(ЭтотОбъект, Отказ);
	// Конец УтверждениеДокументов
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РаботаСГраницами.ПередУдалением(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЗаказыПоставщикамНаАвтомобили.Автомобиль КАК Автомобиль
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили КАК ЗаказыПоставщикамНаАвтомобили
		|ГДЕ
		|	ЗаказыПоставщикамНаАвтомобили.Регистратор = &Регистратор"
	);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	АвтомобилиКПроверке = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Автомобиль");
	
	Если Не ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Документы.ОптовыйЗаказПоставщикуНаАвтомобили.ПроверитьКорректностьИзмененияЗаказа(ЭтотОбъект, АвтомобилиКПроверке,
		Отказ);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если Не ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Документы.ОптовыйЗаказПоставщикуНаАвтомобили.ИнициализироватьДанныеДокумента(ЭтотОбъект, ДополнительныеСвойства);
	
	Если Состояние <> Перечисления.СостоянияОптовогоЗаказаПоставщикуНаАвтомобили.Черновик И Не Отказ Тогда
		
		Документы.ОптовыйЗаказПоставщикуНаАвтомобили.ПроверитьПредоплатыПоЗаказамКлиентов(ЭтотОбъект,
				ДополнительныеСвойства, Отказ);
		
		Если Не Отказ Тогда
			
			Документы.ОптовыйЗаказПоставщикуНаАвтомобили.СформироватьДвиженияЗаказовНаАвтомобили(ЭтотОбъект,
				ДополнительныеСвойства);
			
			Движения.Записать();
			
			Документы.ОптовыйЗаказПоставщикуНаАвтомобили.ПроверитьЗаказыНаАвтомобиль(ЭтотОбъект,
				ДополнительныеСвойства, Отказ);
			
			АвтомобилиКПроверке = ДополнительныеСвойства
				.ДвиженияПередПроведением
				.ЗаказыПоставщикамНаАвтомобили
				.ВыгрузитьКолонку("Автомобиль");
			Документы.ОптовыйЗаказПоставщикуНаАвтомобили.ПроверитьКорректностьИзмененияЗаказа(
				ЭтотОбъект,
				АвтомобилиКПроверке,
				Отказ
			);
				
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не Отказ Тогда
		
		РаботаСГраницами.СдвинутьГраницуЗаказовАвтомобилей(Ссылка, ДополнительныеСвойства, Движения);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбработчикиЗаполненияОбъекта

// Производит заполнение объекта на основании документа "Оптовый заказ поставщику на автомобили"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
// Возвращаемое значение:
//  Булево - Признак возможности дальнейшей обработки события.
//
Функция ОбработкаЗаполнения_ОптовыйЗаказПоставщикуНаАвтомобили(ДанныеЗаполнения,
                                                               ТекстЗаполнения = "",
                                                               СтандартнаяОбработка = Истина) Экспорт

	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка,
		"Автомобили"
	);
	
	Если Не ПродолжитьВыполнение Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Автомобили.Очистить();
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат Истина;
	
КонецФункции

// Производит заполнение объекта на основании документа "Оптовый заказ клиента на автомобили"
//
// Параметры:
//  ДанныеЗаполнения     - Произвольный - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка       - Текст, используемый для заполнения объекта.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
// Возвращаемое значение:
//  Булево - Признак возможности дальнейшей обработки события.
//
Функция ОбработкаЗаполнения_ОптовыйЗаказКлиентаНаАвтомобили(ДанныеЗаполнения,
                                                            ТекстЗаполнения = "",
                                                            СтандартнаяОбработка = Истина) Экспорт

	// Если данные заполнения не указаны, значит производиться проверка существования обработчика заполнения у объекта.
	Если Не ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		Возврат Истина;
	КонецЕсли;
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполненияНаОсновании(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка
	);
	
	Если Не ПродолжитьВыполнение Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ОсновнойПоставщик = ПраваИНастройкиПользователя.Значение("ОсновнойПоставщик", ЭтотОбъект);
	
	Если ЗначениеЗаполнено(ОсновнойПоставщик) И ОсновнойПоставщик <> Контрагент Тогда
		
		Контрагент = ОсновнойПоставщик;
		ПараметрыДействия = Новый Структура();
		Документы.ОптовыйЗаказПоставщикуНаАвтомобили.КонтрагентПриИзменении(ЭтотОбъект, ПараметрыДействия);
		
	КонецЕсли;
	
	ТипЦен = ПраваИНастройкиПользователя.Значение("ОсновнойТипЦенЗакупкиАвтомобилей", ЭтотОбъект);
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОптовыйЗаказКлиентаНаАвтомобилиАвтомобили.Автомобиль,
		|	ОптовыйЗаказКлиентаНаАвтомобилиАвтомобили.Спецификация
		|ПОМЕСТИТЬ АвтомобилиИзЗаказаКлиенту
		|ИЗ
		|	Документ.ОптовыйЗаказКлиентаНаАвтомобили.Автомобили КАК ОптовыйЗаказКлиентаНаАвтомобилиАвтомобили
		|ГДЕ
		|	ОптовыйЗаказКлиентаНаАвтомобилиАвтомобили.Ссылка = &ЗаказПоставщику
		|	И НЕ ОптовыйЗаказКлиентаНаАвтомобилиАвтомобили.Отменено
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗаказыПоставщикамНаАвтомобилиОстатки.Автомобиль
		|ПОМЕСТИТЬ АвтомобилиНаОстатках
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикамНаАвтомобили.Остатки(, Автомобиль В
		|		(ВЫБРАТЬ
		|			АвтомобилиИзЗаказаКлиенту.Автомобиль
		|		ИЗ
		|			АвтомобилиИзЗаказаКлиенту КАК АвтомобилиИзЗаказаКлиенту)) КАК ЗаказыПоставщикамНаАвтомобилиОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ОстаткиАвтомобилейОстатки.Автомобиль
		|ИЗ
		|	РегистрНакопления.ОстаткиАвтомобилей.Остатки(, Автомобиль В
		|		(ВЫБРАТЬ
		|			АвтомобилиИзЗаказаКлиенту.Автомобиль
		|		ИЗ
		|			АвтомобилиИзЗаказаКлиенту КАК АвтомобилиИзЗаказаКлиенту)) КАК ОстаткиАвтомобилейОстатки
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ПродажиАвтомобилейОбороты.Автомобиль
		|ИЗ
		|	РегистрНакопления.ПродажиАвтомобилей.Обороты(&НачалоПериода,,, Автомобиль В
		|		(ВЫБРАТЬ
		|			АвтомобилиИзЗаказаКлиенту.Автомобиль
		|		ИЗ
		|			АвтомобилиИзЗаказаКлиенту КАК АвтомобилиИзЗаказаКлиенту)) КАК
		|		ПродажиАвтомобилейОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	АвтомобилиИзЗаказаКлиенту.Автомобиль,
		|	АвтомобилиИзЗаказаКлиенту.Спецификация
		|ИЗ
		|	АвтомобилиИзЗаказаКлиенту КАК АвтомобилиИзЗаказаКлиенту
		|		ЛЕВОЕ СОЕДИНЕНИЕ АвтомобилиНаОстатках КАК АвтомобилиНаОстатках
		|		ПО АвтомобилиИзЗаказаКлиенту.Автомобиль = АвтомобилиНаОстатках.Автомобиль
		|ГДЕ
		|	АвтомобилиНаОстатках.Автомобиль ЕСТЬ NULL"
	);
	Запрос.УстановитьПараметр("ЗаказПоставщику", ДанныеЗаполнения);
	Запрос.УстановитьПараметр("НачалоПериода", ДанныеЗаполнения.МоментВремени());
	
	Автомобили.Очистить();
	
	АвтомобилиДляДобовленияВЗаказ = Запрос.Выполнить().Выбрать();
	ДобавленныеСпецификации = Новый Массив();
	
	Пока АвтомобилиДляДобовленияВЗаказ.Следующий() Цикл
		
		ДобавленныеСпецификации.Добавить(АвтомобилиДляДобовленияВЗаказ.Спецификация);
		НоваяСтрока = Автомобили.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, АвтомобилиДляДобовленияВЗаказ);
		Документы.ОптовыйЗаказПоставщикуНаАвтомобили.АвтомобилиАвтомобильПриИзменении(ЭтотОбъект, НоваяСтрока);
		
	КонецЦикла;
	
	СпецификацииКУдалению = Новый Массив();
	
	Для Каждого Строка Из Спецификации Цикл
		
		Если ДобавленныеСпецификации.Найти(Строка.КлючСтроки) = Неопределено Тогда
			
			СпецификацииКУдалению.Добавить(Строка);
			
		Иначе
			
			Строка.Количество = Автомобили.НайтиСтроки(Новый Структура("Спецификация", Строка.КлючСтроки)).Количество();
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого СпецификацияКУдалению Из СпецификацииКУдалению Цикл
		
		Спецификации.Удалить(СпецификацияКУдалению);
		
	КонецЦикла;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
